RhinoInside.Revit API Documentation
GeometryDecoder.ToBox Method
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.Box.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Box ToBox(
	this Autodesk.Revit.DB.BoundingBoxXYZ boundingBox
)
@staticmethod
def ToBox(
	boundingBox: Autodesk.Revit.DB.BoundingBoxXYZ
) -> Rhino.Geometry.Box
Parameters
boundingBox
Type: Autodesk.Revit.DB.BoundingBoxXYZ
Revit boundingBox to convert.
Return Value
Type: Rhino.Geometry.Box
Rhino box that is equivalent to the provided Revit boundingBox.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.BoundingBoxXYZ. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBox(BoundingBoxXYZ) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Box rhinoBox = revitBBox.ToBox();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_box = revit_bbox.ToBox() # type: RG.Box
 Using ToBox(BoundingBoxXYZ) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Box rhinoBox = GeometryEncoder.ToBox(revitBBox)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_box = GD.ToBox(revit_bbox) # type: RG.Box
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace